* Begin this activity by explaining to the class that in SQL, there is often more than one way of accomplishing a task. For example, suppose that we want to view the inventory information on a film called "Early Home." One way to do this would be to run several queries in succession. In the first, we would search by the title and obtain its `film_id` number.

In [8]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [9]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/sakila')

In [10]:
film = pd.read_sql_query("select * from film where title = 'Early Home'", engine)
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,268,EARLY HOME,A Amazing Panorama of a Mad Scientist And a Hu...,2006,1,None,6,4.99,96,27.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

Here we see the film_id is 268

In [11]:
inventory = pd.read_sql_query("select * from inventory where film_id = 268", engine)
inventory.head()

   inventory_id  film_id  store_id         last_update
0          1206      268         2 2006-02-15 05:09:17
1          1207      268         2 2006-02-15 05:09:17

We see that there are two copies of this movie (as indicated by two separate `inventory_id` numbers), both located in store number 2.

In [12]:
sql_query = """
select i.inventory_id, i.film_id, i.store_id
from inventory i
join film f
on (i.film_id = f.film_id)
where f.title = 'Early Home';
"""
joined = pd.read_sql_query(sql_query, engine)
joined.head()

   inventory_id  film_id  store_id
0          1206      268         2
1          1207      268         2

## Subqueries

In [13]:
sql_query = """
select * 
from inventory
where film_id IN
(
  select film_id
  from film
  where title = 'Early Home'
);
"""
joined = pd.read_sql_query(sql_query, engine)
joined.head()

   inventory_id  film_id  store_id         last_update
0          1206      268         2 2006-02-15 05:09:17
1          1207      268         2 2006-02-15 05:09:17

Think of the above query as this one:

In [14]:
joined = pd.read_sql_query('select * from inventory where film_id in (268)', engine)
joined

   inventory_id  film_id  store_id         last_update
0          1206      268         2 2006-02-15 05:09:17
1          1207      268         2 2006-02-15 05:09:17